<?php 
function num2word($n,$words) {
    return ($words[($n=($n=$n%100)>19?($n%10):$n)==1?0 : (($n>1&&$n<=4)?1:2)]);
}
function sum2words($n) {
    $words=array(
        900=>'дев\'ятсот',
        800=>'вісімсот',
        700=>'сімсот',
        600=>'шістсот',
        500=>'п\'ятсот',
        400=>'чотириста',
        300=>'триста',
        200=>'двісті',
        100=>'сто',
        90=>'дев\'яносто',
        80=>'вісімдесят',
        70=>'сімдесят',
        60=>'шістдесят',
        50=>'пятдесят',
        40=>'сорок',
        30=>'тридцать',
        20=>'двадцать',
        19=>'дев\'ятнадцать',
        18=>'вісімнадцять',
        17=>'сімнадцять',
        16=>'шістнадцять',
        15=>'пятнадцать',
        14=>'чотирнадцять',
        13=>'тринадцать',
        12=>'дванадцять',
        11=>'одиннадцать',
        10=>'десять',
        9=>'дев\'ять',
        8=>'вісім',
        7=>'сім',
        6=>'шість',
        5=>'пять',
        4=>'чотири',
        3=>'три',
        2=>'два',
        1=>'один',
    );
 
    $level=array(
        4=>array('мільярд', 'мільярда', 'міліардів'),
        3=>array('мільйон', 'мільйона', 'мільйонів'),
        2=>array('тисяча', 'тисячі', 'тисяч'),
    );
 
    list($rub,$kop)=explode('.',number_format($n,2));
    $parts=explode(',',$rub);
 
    for($str='', $l=count($parts), $i=0; $i<count($parts); $i++, $l--) {
        if (intval($num=$parts[$i])) {
            foreach($words as $key=>$value) {
                if ($num>=$key) {
                    // Fix для одної тисячи
                    if ($l==2 && $key==1) {
                        $value='одна';
                    }
                    // Fix для двох тисяч
                    if ($l==2 && $key==2) {
                        $value='дві';
                    }
                    $str.=($str!=''?' ':'').$value;
                    $num-=$key;
                }
            }
            if (isset($level[$l])) {
                $str.=' '.num2word($parts[$i],$level[$l]);
            }
        }
    }
 
    if (intval($rub=str_replace(',','',$rub))) {
        $str.=' '.num2word($rub,array('гривня', 'гривні', 'гривень'));
    }
 
    $str.=($str!=''?' ':'').$kop;
    $str.=' '.num2word($kop,array('копійка', 'копійки', 'копійок'));
 
    return mb_strtoupper(mb_substr($str,0,1,'utf-8'),'utf-8').
         mb_substr($str,1,mb_strlen($str,'utf-8'),'utf-8');
}


$month_uk = array('01'=>'Січень', '02'=>'Лютий', '03'=>'Березень','04'=>'Квітень','05'=>'Травень','06'=>'Червень','07'=>'Липень','08'=>'Серпень','09'=>'Вересень','10'=>'Жовтень','11'=>'Листопад','12'=>'Грудень');